     Different ways of creating the DFs:
(i)  Creating a DataFrame Object from a 2-D Dictionary

    (a) Creating a dataframe from a 2-D Dictionary having values as Lists/ndarrays
    (b) Creating a dataframe from a 2-D Dictionary having values as Dictionary Objects
    
(ii) Creating a dataframe from a List of Dictionaries/Lists  

(iii)Creating a DataFrame Object from a 2-D ndarray

(iv) Creating a DataFrame Object from a 2-D Dictionary with Values as Series Objects

(v)  Creating a DataFrame Object from another Dataframe Object

# (i) Creating a DataFrame Object from a 2-D Dictionary

 (a) Creating a dataframe from a 2-D Dictionary having values as Lists/ndarrays

In [1]:
import pandas as pd
import numpy as np

dict1={'Students':['ruchika','Neha','Mark','Gurjyot','Jamaal'],
       'Marks':[79.5,83.75,74,88.5,89],
        'Sports':['cricket','badminton','football','athletics','kabaddi']}

df1=pd.DataFrame(dict1)
df1

  Students  Marks     Sports
0  ruchika  79.50    cricket
1     Neha  83.75  badminton
2     Mark  74.00   football
3  Gurjyot  88.50  athletics
4   Jamaal  89.00    kabaddi

In [2]:
df1=pd.DataFrame(dict1,index=['I','II','III','IV','V'])
df1
#no of indexes given in the index sequence must match the length of dictionary's values.

    Students  Marks     Sports
I    ruchika  79.50    cricket
II      Neha  83.75  badminton
III     Mark  74.00   football
IV   Gurjyot  88.50  athletics
V     Jamaal  89.00    kabaddi

(b) Creating a dataframe from a 2-D Dictionary having values as Dictionary Objects

In [3]:
people={'Sales':{'name':'Rohit','age':'24','sex':'Male'},        #outer dictionary keys as columns
        'Marketing':{'name':'Neha','age':'25','sex':'Female'}}   #inner dictionary keys as indexes
df2=pd.DataFrame(people)
df2

      Sales Marketing
name  Rohit      Neha
age      24        25
sex    Male    Female

In [4]:
yr1={'Qtr1':44900,'Qtr2':46100,'Qtr3':57000,'Qtr4':59000}     #two dictionaries with disimillar keys  
yr2={'A':54500,'B':51000,'Qtr4':57000}    #all inner keys become indexes
diSales={'I':yr1,'II':yr2}     #Dictionaries with disimillar keys as inner dictionaries of a 2-D dictionary
df3=pd.DataFrame(diSales)      #DataFrame created with non- matching inner key dictionaries
df3

#NaN values added for non-matching keys of inner dictionaries

            I       II
Qtr1  44900.0      NaN
Qtr2  46100.0      NaN
Qtr3  57000.0      NaN
Qtr4  59000.0  57000.0
A         NaN  54500.0
B         NaN  51000.0

# (ii) Creating a dataframe from a List of Dictionaries/Lists

In [5]:
topperA={'Rollno':115,'Name':'Avni','Marks':97.5}          #keys of inner Dictionaries have made the columns of the DF
topperB={'Rollno':236,'Name':'Rishi','Marks':98}            
topperC={'Rollno':307,'Name':'Preet','Marks':98.5}         #values of the inner Dictionaries have made the rows of the DF
topperD={'Rollno':422,'Name':'Karan','Marks':98}
toppers=[topperA,topperB,topperC,topperD]           #---->list of dictionaries
topdf=pd.DataFrame(toppers,index=["SecA","SecB","SecC","SecD"])
topdf

      Rollno   Name  Marks
SecA     115   Avni   97.5
SecB     236  Rishi   98.0
SecC     307  Preet   98.5
SecD     422  Karan   98.0

*Passing a 2-D list i.e. A List having Lists will also create a DataFrame where each inner list will form the row of DF

In [6]:
import pandas as pd
list1=[[25,45,60],[34,67,89],[88,90,56]]     #the inner list have formed a row each, in the created DF
dfl=pd.DataFrame(list1,index=["A","B","C"],columns=["X","Y","Z"])
dfl

    X   Y   Z
A  25  45  60
B  34  67  89
C  88  90  56

# (iii)Creating a DataFrame Object from a 2-D ndarray

In [7]:
import pandas as pd
import numpy as np
narr2=np.array([[101.5,201.2],[400,50,600,700],[212.3,301.5,405.2]],dtype=object)   #datatype of the ndarray is 'object'
dtf2=pd.DataFrame(narr2)
dtf2                       #if no. of elements in each row differ, then Python will create just a single column in DF Object
                           # and type of the column will be considered as Object....using 'dtype=object'

                       0
0         [101.5, 201.2]
1    [400, 50, 600, 700]
2  [212.3, 301.5, 405.2]

In [8]:
narr3=np.array([[101.5,201.2,700],[400,50,600],[212.3,301.5,405.2]],np.float32)
dtf3=pd.DataFrame(narr3,index=["A","B","C"],columns=["X","Y","Z"])
dtf3

            X           Y           Z
A  101.500000  201.199997  700.000000
B  400.000000   50.000000  600.000000
C  212.300003  301.500000  405.200012

# (iv) Creating a DataFrame Object from a 2-D Dictionary with Values as Series Objects

You can create a DataFrame Object by using multiple Series Objects

In [9]:
staff=pd.Series([20,36,44])                
salaries=pd.Series([166000,246000,563000])
avg=salaries/staff                                    # it will create 'avg' series object
org={'People':staff,'Amount':salaries,'Average':avg}  #a dictionary that stores these Series objects as values
df4=pd.DataFrame(org)
df4

   People  Amount       Average
0      20  166000   8300.000000
1      36  246000   6833.333333
2      44  563000  12795.454545

# (v) Creating a DataFrame Object from another Dataframe Object

You can pass an existing DataFrame object to DataFrame() and it will create an another DataFrame object having similar Data

In [10]:
dict1={'Students':['ruchika','Neha','Mark','Gurjyot','Jamaal'],
       'Marks':[79.5,83.75,74,88.5,89],
        'Sports':['cricket','badminton','football','athletics','kabaddi']}

df1=pd.DataFrame(dict1)
df1

  Students  Marks     Sports
0  ruchika  79.50    cricket
1     Neha  83.75  badminton
2     Mark  74.00   football
3  Gurjyot  88.50  athletics
4   Jamaal  89.00    kabaddi

In [11]:
dfnew=pd.DataFrame(df1)
dfnew

  Students  Marks     Sports
0  ruchika  79.50    cricket
1     Neha  83.75  badminton
2     Mark  74.00   football
3  Gurjyot  88.50  athletics
4   Jamaal  89.00    kabaddi

When you create a dataframe using another dataframe, you should add an aditional argument to dataframe() method as copy=True.
It will ensure that the new dataframe created as true copy and no changes in the original dataframe are reflected in it.

# DataFrame Attributes            <Dataframe object>.<attribute name>

In [12]:
import pandas as pd
people={'Marketing':{'name':'Neha','age':'25','sex':'Female'},
        'Sales':{'name':'Rohit','age':'24','sex':'Male'}}       
df2=pd.DataFrame(people)
df2

     Marketing  Sales
name      Neha  Rohit
age         25     24
sex     Female   Male

(a) Retrieving Various Properties of a DataFrame Object

In [13]:
df2.index

Index(['name', 'age', 'sex'], dtype='object')

In [14]:
df2.columns

Index(['Marketing', 'Sales'], dtype='object')

In [15]:
df2.axes

[Index(['name', 'age', 'sex'], dtype='object'),
 Index(['Marketing', 'Sales'], dtype='object')]

In [16]:
df2.dtypes

Marketing    object
Sales        object
dtype: object

In [17]:
df2.size

6

In [18]:
df2.shape

(3, 2)

In [19]:
df2.ndim

2

In [20]:
df2.empty

False

(b) Getting Number of Rows in a DataFrame

In [21]:
len(df2)

3

(c) Getting Count of non-NaN values in a DataFrame

In [22]:
df2.count()

Marketing    3
Sales        3
dtype: int64

In [23]:
df2.count(1)

name    2
age     2
sex     2
dtype: int64

In [24]:
df2.count(axis='index')

Marketing    3
Sales        3
dtype: int64

In [25]:
df2.count(axis='columns')

name    2
age     2
sex     2
dtype: int64

(d) Transposing DataFrame

In [26]:
df2.T

            name age     sex
Marketing   Neha  25  Female
Sales      Rohit  24    Male

(e) Numpy Representation of a DataFrame

In [27]:
df2.values

array([['Neha', 'Rohit'],
       ['25', '24'],
       ['Female', 'Male']], dtype=object)